apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
/****************************************************************************
 * arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3C5XX_PINMAP_H
#define __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3C5XX_PINMAP_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Alternate Pin Functions.  This map contains every GPIO alternate
 * function available on the supported device package:
 *
 *   STM32U3C5ZI-Q LQFP144
 *
 * It is derived from the ST device package pinout data.  It also
 * contains the peripheral analog pins represented by the NuttX GPIO
 * pin-map interface.
 *
 * Alternative pin selections are provided with a numeric suffix like _1,
 * _2, etc.  Drivers use the selection without the numeric suffix; board.h
 * must map that name to the pin used by the board.  For example:
 *
 * #define GPIO_FDCAN1_RX GPIO_FDCAN1_RX_1
 *
 * Pull resistors, output type, and slew rate are board-specific and are not
 * encoded here.  Timer channels have separate input and output names to
 * match the NuttX timer driver contracts.
 */

/* Analog-to-digital converters */

#define GPIO_ADC1_IN1_1              (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN0)
#define GPIO_ADC1_IN2_1              (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN1)
#define GPIO_ADC1_IN3_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN0)
#define GPIO_ADC1_IN4_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN1)
#define GPIO_ADC1_IN5_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN2)
#define GPIO_ADC1_IN6_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN3)
#define GPIO_ADC1_IN7_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_ADC1_IN8_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_ADC1_IN9_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_ADC1_IN10_1             (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADC1_IN13_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_ADC1_IN14_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_ADC1_IN15_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN2)
#define GPIO_ADC2_IN1_1              (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN2)
#define GPIO_ADC2_IN2_1              (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN3)
#define GPIO_ADC2_IN3_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_ADC2_IN4_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_ADC2_IN5_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_ADC2_IN6_1              (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADC2_IN9_1              (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_ADC2_IN10_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_ADC2_IN11_1             (GPIO_ANALOG | GPIO_PORTD | GPIO_PIN11)
#define GPIO_ADC2_IN12_1             (GPIO_ANALOG | GPIO_PORTD | GPIO_PIN12)
#define GPIO_ADC2_IN13_1             (GPIO_ANALOG | GPIO_PORTD | GPIO_PIN13)

/* Audio digital filter */

#define GPIO_ADF1_CCK0_1             (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_ADF1_CCK0_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_ADF1_CCK1_1             (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_ADF1_SDI0_1             (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_ADF1_SDI0_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_ADF1_SDI0_3             (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN10)

/* Audio clock input */

#define GPIO_AUDIOCLK_1              (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_AUDIOCLK_2              (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN0)

/* Comparators */

#define GPIO_COMP1_INM_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_COMP1_INP_1             (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN2)
#define GPIO_COMP1_INP_2             (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN3)
#define GPIO_COMP1_INP_3             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN2)
#define GPIO_COMP1_OUT_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_COMP1_OUT_2             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_COMP2_INM_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN3)
#define GPIO_COMP2_INM_2             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN7)
#define GPIO_COMP2_INP_1             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN4)
#define GPIO_COMP2_INP_2             (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN6)
#define GPIO_COMP2_OUT_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_COMP2_OUT_2             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN11)

/* Clock recovery system */

#define GPIO_CRS_SYNC_1              (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_CRS_SYNC_2              (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN3)

/* Digital-to-analog converters */

#define GPIO_DAC1_OUT1_1             (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_DAC1_OUT2_1             (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)

/* Debug support */

#define GPIO_JTCK_SWCLK_1            (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_JTDI_1                  (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_JTDO_TRACESWO_1         (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_JTMS_SWDIO_1            (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_NJTRST_1                (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TRACECLK_1              (GPIO_ALT | GPIO_AF12 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TRACECLK_2              (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_TRACED0_1               (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_TRACED0_2               (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TRACED0_3               (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_TRACED1_1               (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_TRACED1_2               (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_TRACED2_1               (GPIO_ALT | GPIO_AF0 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_TRACED2_2               (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_TRACED3_1               (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TRACED3_2               (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN6)

