apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
/* Armv8-M event output */

#define GPIO_PA0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_PA1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_PA2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_PA3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_PA4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_PA5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_PA6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_PA7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_PA8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_PA9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_PA10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_PA11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_PA12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_PA13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_PA14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_PA15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_PB0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_PB1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_PB2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_PB3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_PB4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_PB5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_PB6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_PB7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_PB8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_PB9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_PB10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_PB11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_PB13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_PB14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_PB15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_PC0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_PC1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_PC2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_PC3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_PC6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_PC7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_PC8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_PC9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_PC10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_PC11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_PC12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_PC13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN13)
#define GPIO_PC14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_PC15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN15)
#define GPIO_PD0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_PD1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_PD2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_PD3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_PD4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_PD5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_PD6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_PD7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_PD8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN8)
#define GPIO_PD9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_PD10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_PD11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_PD12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_PD13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_PD14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_PD15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN15)
#define GPIO_PE0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN0)
#define GPIO_PE1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN1)
#define GPIO_PE2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_PE3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_PE4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_PE5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_PE6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_PE7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_PE8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_PE9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_PE10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_PE11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_PE12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_PE13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_PE14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_PE15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_PF0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_PF1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_PF2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_PF3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_PF4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_PF5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_PF6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN6)
#define GPIO_PF7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_PF8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_PF9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_PF10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN10)
#define GPIO_PF11_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_PF12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_PF13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN13)
#define GPIO_PF14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_PF15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN15)
#define GPIO_PG0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN0)
#define GPIO_PG1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN1)
#define GPIO_PG2_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_PG3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_PG4_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_PG5_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_PG6_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_PG7_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_PG8_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_PG9_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_PG10_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_PG12_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_PG13_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_PG14_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_PG15_EVENTOUT_1         (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN15)
#define GPIO_PH0_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTH | GPIO_PIN0)
#define GPIO_PH1_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTH | GPIO_PIN1)
#define GPIO_PH3_EVENTOUT_1          (GPIO_ALT | GPIO_AF15 | GPIO_PORTH | GPIO_PIN3)

/* Flexible data-rate CAN */

#define GPIO_FDCAN1_RX_1             (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_FDCAN1_RX_2             (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_FDCAN1_RX_3             (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FDCAN1_RX_4             (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_FDCAN1_TX_1             (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_FDCAN1_TX_2             (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_FDCAN1_TX_3             (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FDCAN1_TX_4             (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_FDCAN2_RX_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_FDCAN2_TX_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_FDCAN2_TX_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN13)

/* High-speed parallel interface */

#define GPIO_HSP1_SNP0_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_HSP1_SNP0_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_HSP1_SNP1_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_HSP1_SNP1_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_HSP1_SNP2_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_HSP1_SNP2_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_HSP1_SNP3_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_HSP1_SNP3_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_HSP1_SNP4_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_HSP1_SNP4_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_HSP1_SNP5_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_HSP1_SNP5_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTC | GPIO_PIN10)

/* Inter-integrated circuit interfaces */

#define GPIO_I2C1_SCL_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I2C1_SCL_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2C1_SCL_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_I2C1_SDA_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2C1_SDA_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C1_SDA_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2C1_SDA_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_I2C1_SMBA_1             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_I2C1_SMBA_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C1_SMBA_3             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2C1_SMBA_4             (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN15)
#define GPIO_I2C2_SCL_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I2C2_SCL_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2C2_SCL_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I2C2_SCL_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_I2C2_SDA_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_I2C2_SDA_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_I2C2_SDA_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_I2C2_SDA_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_I2C2_SMBA_1             (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_I2C2_SMBA_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C2_SMBA_3             (GPIO_ALT | GPIO_AF4 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_I2C3_SCL_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_I2C3_SCL_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_I2C3_SCL_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_I2C3_SCL_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_I2C3_SDA_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2C3_SDA_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_I2C3_SDA_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_I2C3_SDA_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_I2C3_SMBA_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C3_SMBA_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I2C3_SMBA_3             (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_I2C3_SMBA_4             (GPIO_ALT | GPIO_AF4 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_I2C4_SCL_1              (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I2C4_SCL_2              (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2C4_SCL_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_I2C4_SCL_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_I2C4_SDA_1              (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C4_SDA_2              (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_I2C4_SDA_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_I2C4_SDA_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTF | GPIO_PIN15)
#define GPIO_I2C4_SMBA_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_I2C4_SMBA_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_I2C4_SMBA_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTF | GPIO_PIN13)

/* Improved inter-integrated circuit interfaces */

#define GPIO_I3C1_SCL_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_I3C1_SCL_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I3C1_SCL_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I3C1_SCL_4              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I3C1_SCL_5              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I3C1_SCL_6              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I3C1_SCL_7              (GPIO_ALT | GPIO_AF3 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_I3C1_SCL_8              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_I3C1_SDA_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_I3C1_SDA_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_I3C1_SDA_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I3C1_SDA_4              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I3C1_SDA_5              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_I3C1_SDA_6              (GPIO_ALT | GPIO_AF3 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_I3C1_SDA_7              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_I3C1_SDA_8              (GPIO_ALT | GPIO_AF3 | GPIO_PORTH | GPIO_PIN3)
#define GPIO_I3C2_SCL_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I3C2_SCL_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I3C2_SCL_3              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I3C2_SCL_4              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I3C2_SCL_5              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_I3C2_SCL_6              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_I3C2_SDA_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_I3C2_SDA_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I3C2_SDA_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I3C2_SDA_4              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_I3C2_SDA_5              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_I3C2_SDA_6              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_I3C2_SDA_7              (GPIO_ALT | GPIO_AF6 | GPIO_PORTH | GPIO_PIN3)

