apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
/* Infrared output */

#define GPIO_IR_OUT_1                (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_IR_OUT_2                (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN9)

/* Low-power timers */

#define GPIO_LPTIM1_CH1_1            (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_LPTIM1_CH1_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_LPTIM1_CH1_3            (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_LPTIM1_CH1_4            (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_LPTIM1_CH1_5            (GPIO_ALT | GPIO_AF1 | GPIO_PORTG | GPIO_PIN15)
#define GPIO_LPTIM1_CH2_1            (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_LPTIM1_CH2_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_LPTIM1_CH2_3            (GPIO_ALT | GPIO_AF1 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_LPTIM1_ETR_1            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LPTIM1_ETR_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_LPTIM1_ETR_3            (GPIO_ALT | GPIO_AF1 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_LPTIM1_IN1_1            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_LPTIM1_IN1_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPTIM1_IN1_3            (GPIO_ALT | GPIO_AF1 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_LPTIM1_IN2_1            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_LPTIM1_IN2_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_LPTIM2_CH1_1            (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_LPTIM2_CH1_2            (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_LPTIM2_CH1_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_LPTIM2_CH2_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_LPTIM2_CH2_2            (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_LPTIM2_CH2_3            (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_LPTIM2_ETR_1            (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_LPTIM2_ETR_2            (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_LPTIM2_ETR_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_LPTIM2_IN1_1            (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPTIM2_IN1_2            (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPTIM2_IN1_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_LPTIM2_IN2_1            (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_LPTIM2_IN2_2            (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_LPTIM2_IN2_3            (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_LPTIM3_CH1_1            (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_LPTIM3_CH1_2            (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPTIM3_CH1_3            (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_LPTIM3_CH1_4            (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_LPTIM3_CH1_5            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_LPTIM3_CH1_6            (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_LPTIM3_CH2_1            (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPTIM3_CH2_2            (GPIO_ALT | GPIO_AF14 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_LPTIM3_CH2_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN15)
#define GPIO_LPTIM3_CH2_4            (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_LPTIM3_ETR_1            (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_LPTIM3_ETR_2            (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_LPTIM3_ETR_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_LPTIM3_ETR_4            (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_LPTIM3_IN1_1            (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPTIM3_IN1_2            (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_LPTIM3_IN1_3            (GPIO_ALT | GPIO_AF14 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_LPTIM3_IN1_4            (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_LPTIM4_ETR_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_LPTIM4_ETR_2            (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_LPTIM4_IN1_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_LPTIM4_IN1_2            (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_LPTIM4_OUT_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_LPTIM4_OUT_2            (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN13)

/* Low-power UART */

#define GPIO_LPUART1_CTS_1           (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_LPUART1_CTS_2           (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPUART1_CTS_3           (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_LPUART1_RTS_DE_1        (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_LPUART1_RTS_DE_2        (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_LPUART1_RX_1            (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_LPUART1_RX_2            (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_LPUART1_RX_3            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPUART1_RX_4            (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_LPUART1_RX_5            (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_LPUART1_TX_1            (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_LPUART1_TX_2            (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_LPUART1_TX_3            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_LPUART1_TX_4            (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_LPUART1_TX_5            (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN7)

/* Clock outputs */

