apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
#define GPIO_MCO_1                   (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_MCO_2                   (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_MCO2_1                  (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_MCO2_2                  (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN10)

/* OctoSPI */

#define GPIO_OCTOSPI1_CLK_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_OCTOSPI1_CLK_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_OCTOSPI1_CLK_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_OCTOSPI1_CLK_4          (GPIO_ALT | GPIO_AF3 | GPIO_PORTF | GPIO_PIN10)
#define GPIO_OCTOSPI1_CLK_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_OCTOSPI1_CLK_6          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_OCTOSPI1_DQS_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_OCTOSPI1_DQS_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_OCTOSPI1_DQS_3          (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_OCTOSPI1_DQS_4          (GPIO_ALT | GPIO_AF3 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_OCTOSPI1_DQS_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN15)
#define GPIO_OCTOSPI1_IO0_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_OCTOSPI1_IO0_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_OCTOSPI1_IO0_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_OCTOSPI1_IO0_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_OCTOSPI1_IO0_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_OCTOSPI1_IO1_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_OCTOSPI1_IO1_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_OCTOSPI1_IO1_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_OCTOSPI1_IO1_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_OCTOSPI1_IO1_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_OCTOSPI1_IO2_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_OCTOSPI1_IO2_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_OCTOSPI1_IO2_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_OCTOSPI1_IO2_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_OCTOSPI1_IO2_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_OCTOSPI1_IO3_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO3_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO3_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_OCTOSPI1_IO3_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO3_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_OCTOSPI1_IO4_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_OCTOSPI1_IO4_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_OCTOSPI1_IO4_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_OCTOSPI1_IO4_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_OCTOSPI1_IO5_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO5_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_OCTOSPI1_IO5_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_OCTOSPI1_IO5_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO6_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_OCTOSPI1_IO6_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_OCTOSPI1_IO6_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_OCTOSPI1_IO6_4          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_OCTOSPI1_IO7_1          (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_OCTOSPI1_IO7_2          (GPIO_ALT | GPIO_AF10 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_OCTOSPI1_IO7_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_OCTOSPI1_NCLK_1         (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_OCTOSPI1_NCLK_2         (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_OCTOSPI1_NCLK_3         (GPIO_ALT | GPIO_AF3 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_OCTOSPI1_NCLK_4         (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_OCTOSPI1_NCS_1          (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_OCTOSPI1_NCS_2          (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_OCTOSPI1_NCS_3          (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_OCTOSPI1_NCS_4          (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_OCTOSPI1_NCS_5          (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_OCTOSPI1_NCS_6          (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN12)

/* Operational amplifiers */

#define GPIO_OPAMP1_VINM_1           (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN1)
#define GPIO_OPAMP1_VINP_1           (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN0)
#define GPIO_OPAMP1_VOUT_1           (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN3)
#define GPIO_OPAMP2_VINM_1           (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_OPAMP2_VINP_1           (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_OPAMP2_VOUT_1           (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)

/* Power control */

#define GPIO_CSLEEP_1                (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_CSLEEP_2                (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_CSTOP_1                 (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_CSTOP_2                 (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN8)

/* Real-time clock */

#define GPIO_RTC_REFIN_1             (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN15)

