apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
/* Serial audio interface */

#define GPIO_SAI1_CK1_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_SAI1_CK1_2              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SAI1_CK1_3              (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_SAI1_CK1_4              (GPIO_ALT | GPIO_AF3 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_SAI1_CK2_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SAI1_CK2_2              (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_SAI1_D1_1               (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_SAI1_D1_2               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_SAI1_D1_3               (GPIO_ALT | GPIO_AF3 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_SAI1_D1_4               (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_SAI1_D2_1               (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SAI1_D2_2               (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SAI1_D2_3               (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_SAI1_D3_1               (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SAI1_FS_A_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_SAI1_FS_A_2             (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SAI1_FS_A_3             (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_SAI1_FS_B_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SAI1_FS_B_2             (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_SAI1_FS_B_3             (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_SAI1_FS_B_4             (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_SAI1_FS_B_5             (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_SAI1_MCLK_A_1           (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_SAI1_MCLK_A_2           (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SAI1_MCLK_A_3           (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_SAI1_MCLK_A_4           (GPIO_ALT | GPIO_AF13 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_SAI1_MCLK_B_1           (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SAI1_MCLK_B_2           (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_SAI1_MCLK_B_3           (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_SAI1_SCK_A_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SAI1_SCK_A_2            (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_SAI1_SCK_A_3            (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_SAI1_SCK_B_1            (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_SAI1_SCK_B_2            (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_SAI1_SCK_B_3            (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_SAI1_SD_A_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_SAI1_SD_A_2             (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_SAI1_SD_A_3             (GPIO_ALT | GPIO_AF13 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_SAI1_SD_A_4             (GPIO_ALT | GPIO_AF13 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_SAI1_SD_A_5             (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_SAI1_SD_B_1             (GPIO_ALT | GPIO_AF13 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_SAI1_SD_B_2             (GPIO_ALT | GPIO_AF13 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SAI1_SD_B_3             (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_SAI1_SD_B_4             (GPIO_ALT | GPIO_AF13 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_SAI1_SD_B_5             (GPIO_ALT | GPIO_AF13 | GPIO_PORTF | GPIO_PIN6)

/* Secure digital and multimedia card interface */

#define GPIO_SDMMC1_CDIR_1           (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SDMMC1_CDIR_2           (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_SDMMC1_CK_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_SDMMC1_CK_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_SDMMC1_CKIN_1           (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SDMMC1_CMD_1            (GPIO_ALT | GPIO_AF12 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_SDMMC1_D0_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_SDMMC1_D0_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_SDMMC1_D0DIR_1          (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_SDMMC1_D0DIR_2          (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_SDMMC1_D1_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_SDMMC1_D1_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_SDMMC1_D2_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_SDMMC1_D2_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_SDMMC1_D3_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_SDMMC1_D3_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_SDMMC1_D4_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SDMMC1_D4_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_SDMMC1_D5_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SDMMC1_D5_2             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_SDMMC1_D5_3             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_SDMMC1_D6_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_SDMMC1_D6_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_SDMMC1_D7_1             (GPIO_ALT | GPIO_AF12 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_SDMMC1_D7_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_SDMMC1_D123DIR_1        (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_SDMMC1_D123DIR_2        (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN10)

/* Serial peripheral interfaces */

#define GPIO_SPI1_MISO_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_SPI1_MISO_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_SPI1_MISO_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI1_MISO_4             (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_SPI1_MISO_5             (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_SPI1_MOSI_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_SPI1_MOSI_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_SPI1_MOSI_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI1_MOSI_4             (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_SPI1_MOSI_5             (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_SPI1_NSS_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI1_NSS_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI1_NSS_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_SPI1_NSS_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_SPI1_NSS_5              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_SPI1_RDY_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_SPI1_RDY_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SPI1_RDY_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_SPI1_RDY_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_SPI1_RDY_5              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_SPI1_SCK_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_SPI1_SCK_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_SPI1_SCK_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_SPI1_SCK_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_SPI1_SCK_5              (GPIO_ALT | GPIO_AF5 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_SPI2_MISO_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SPI2_MISO_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_SPI2_MISO_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_SPI2_MOSI_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI2_MOSI_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_SPI2_MOSI_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_SPI2_MOSI_4             (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_SPI2_NSS_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SPI2_NSS_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_SPI2_RDY_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_SPI2_RDY_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_SPI2_RDY_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_SPI2_SCK_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_SPI2_SCK_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_SPI2_SCK_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_SPI2_SCK_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_SPI2_SCK_5              (GPIO_ALT | GPIO_AF3 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_SPI3_MISO_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI3_MISO_2             (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_SPI3_MISO_3             (GPIO_ALT | GPIO_AF6 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_SPI3_MOSI_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI3_MOSI_2             (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_SPI3_MOSI_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_SPI3_NSS_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI3_NSS_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI3_NSS_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_SPI3_RDY_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_SPI3_RDY_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SPI3_RDY_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_SPI3_SCK_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_SPI3_SCK_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_SPI3_SCK_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_SPI4_MISO_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_SPI4_MISO_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_SPI4_MISO_3             (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_SPI4_MOSI_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_SPI4_MOSI_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_SPI4_MOSI_3             (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_SPI4_NSS_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_SPI4_NSS_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_SPI4_NSS_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_SPI4_RDY_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_SPI4_RDY_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_SPI4_RDY_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_SPI4_SCK_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SPI4_SCK_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_SPI4_SCK_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN12)

/* Timers */

