apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3c5xx_pinmap.h
/* Touch sensing controller */

#define GPIO_TSC_G1_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TSC_G1_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TSC_G1_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TSC_G2_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TSC_G2_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TSC_G2_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TSC_G2_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TSC_G3_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TSC_G3_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_TSC_G3_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_TSC_G3_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TSC_G4_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TSC_G4_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TSC_G4_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TSC_G4_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TSC_G5_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_TSC_G5_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_TSC_G5_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_TSC_G5_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_TSC_G6_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_TSC_G6_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_TSC_G6_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_TSC_G6_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_TSC_G7_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_TSC_G7_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_TSC_G7_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_TSC_G7_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_TSC_G8_IO1_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_TSC_G8_IO2_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN15)
#define GPIO_TSC_G8_IO3_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTG | GPIO_PIN0)
#define GPIO_TSC_G8_IO4_1            (GPIO_ALT | GPIO_AF9 | GPIO_PORTG | GPIO_PIN1)
#define GPIO_TSC_SYNC_1              (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TSC_SYNC_2              (GPIO_ALT | GPIO_AF9 | GPIO_PORTD | GPIO_PIN2)

/* Universal asynchronous receiver/transmitters */

#define GPIO_UART4_CTS_1             (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_UART4_RTS_DE_1          (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_UART4_RX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_UART4_RX_2              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_UART4_TX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_UART4_TX_2              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_UART5_CTS_1             (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_UART5_RTS_DE_1          (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_UART5_RX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_UART5_TX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN12)

/* Universal synchronous/asynchronous receiver/transmitters */

#define GPIO_USART1_CK_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_USART1_CK_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_USART1_CK_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_USART1_CK_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_USART1_CTS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_CTS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_USART1_CTS_3            (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_USART1_NSS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_NSS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_USART1_NSS_3            (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_USART1_RTS_DE_1         (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART1_RTS_DE_2         (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_USART1_RTS_DE_3         (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_USART1_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_USART1_RX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART1_RX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_USART1_TX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_USART1_TX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART1_TX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_USART2_CK_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_USART2_CK_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_USART2_CTS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_CTS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_USART2_NSS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_NSS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_USART2_RTS_DE_1         (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_USART2_RTS_DE_2         (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_USART2_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_USART2_RX_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART2_RX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_USART2_TX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_USART2_TX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_USART3_CK_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_USART3_CK_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_USART3_CK_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_USART3_CTS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_USART3_CTS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_CTS_3            (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_USART3_NSS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_USART3_NSS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_NSS_3            (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_USART3_RTS_DE_1         (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART3_RTS_DE_2         (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_USART3_RTS_DE_3         (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART3_RTS_DE_4         (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_USART3_RTS_DE_5         (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_USART3_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_USART3_RX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_USART3_RX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART3_RX_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_USART3_TX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_USART3_TX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_USART3_TX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_USART3_TX_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN8)

/* USB full-speed interface */

#define GPIO_USB_DM_1                (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USB_DP_1                (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USB_NOE_1               (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_USB_SOF_1               (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN14)

#endif /* __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3C5XX_PINMAP_H */
